BaiYang52/BCM_S32K344/CBD2300384_D00/ThirdParty/Mcal_S32k/Supply/tresos/plugins/Mcl_TS_T40D34M20I1R0/generate_PC/include/Dma_Ip_Cfg_DeviceRegistersV3.h
/*-----------------------------------------------/
/  DMA HWV3 CHANNELS                             /
/-----------------------------------------------*/
     [!CODE!][!WS "0"!]
    #define DMA_IP_TCD_BASE                     (0x40210000U)
    #define DMA_IP_TCD_PTR                      ((Dma_Ip_Hwv3TcdArrayType *)DMA_IP_TCD_BASE)
    #define DMA_IP_TCD_BASE_PTRS                { DMA_IP_TCD_PTR }
    [!CR!][!ENDCODE!][!//
 
#define DMA_IP_TCD_RESERVED                 (16320U)                     /* Reserved space between hardware TCDs */

#define DMA_IP_TCD_NOF_HWV3_CH              ((uint32)32U)                /* Number of hardware channels */
#define DMA_IP_TCD_NOF_HWV3_CH_INST         DMA_TCD_INSTANCE_COUNT       /* Number of hardware TCD instances */


/*-----------------------------------------------/
/  DMA HWV3 TOTAL CHANNELS                       /
/-----------------------------------------------*/
#define DMA_IP_NOF_HWV3_CH                  (DMA_IP_TCD_NOF_HWV3_CH_INST * DMA_IP_TCD_NOF_HWV3_CH)  /* Total number of hardware channels of all instances */

/*-----------------------------------------------/
/  DMA HWV3 INSTANCE ES MASK                     /
/-----------------------------------------------*/
#define DMA_IP_MP_ES_MASK                   (DMA_IP_MP_ES_DBE_MASK | DMA_IP_MP_ES_SBE_MASK |\
                                             DMA_IP_MP_ES_SGE_MASK | DMA_IP_MP_ES_NCE_MASK |\
                                             DMA_IP_MP_ES_DOE_MASK | DMA_IP_MP_ES_DAE_MASK |\
                                             DMA_IP_MP_ES_SOE_MASK | DMA_IP_MP_ES_SAE_MASK |\
                                             DMA_IP_MP_ES_ECX_MASK | DMA_IP_MP_ES_UCE_MASK |\
                                             DMA_IP_MP_ES_ERRCHN_MASK | DMA_IP_MP_ES_VLD_MASK)

/*-----------------------------------------------/
/  DMA HWV3 CHANNEL ES MASK                      /
/-----------------------------------------------*/
#define DMA_IP_TCD_CH_ES_MASK               (DMA_IP_TCD_CH_ES_DBE_MASK | DMA_IP_TCD_CH_ES_SBE_MASK |\
                                             DMA_IP_TCD_CH_ES_SGE_MASK | DMA_IP_TCD_CH_ES_NCE_MASK |\
                                             DMA_IP_TCD_CH_ES_DOE_MASK | DMA_IP_TCD_CH_ES_DAE_MASK |\
                                             DMA_IP_TCD_CH_ES_SOE_MASK | DMA_IP_TCD_CH_ES_SAE_MASK |\
                                             DMA_IP_TCD_CH_ES_ERR_MASK)

/*==================================================================================================
                                       DMA TCD NOT ALIGNED
==================================================================================================*/
#define DMA_IP_TCD_NOT_ALIGNED               STD_ON
/** TCD array pointer initialization: */
     [!CODE!][!WS "0"!]
    #define DMA_IP_TCD_PTR_ARRAY               {{((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(0U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(1U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(3U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(4U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(5U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(6U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(7U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(8U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(9U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(10U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(11U * 16384U))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (0U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (1U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (2U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (3U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (4U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (5U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (6U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (7U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (8U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (9U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (10U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (11U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (12U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (13U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (14U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (15U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (16U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (17U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (18U * 16384U)))),\
                                                 ((Dma_Ip_Hwv3ChTcdRegType *)((uint32)DMA_IP_TCD_BASE + (uint32)(2097152U + (19U * 16384U))))}}
    [!CR!][!ENDCODE!][!//
 
